Revit 2027 API
StructuralElementDefinitionData.Section Property
 Structural section of the element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSection Section { get; }
Public ReadOnly Property Section As StructuralSection
	Get
public:
property StructuralSection^ Section {
	StructuralSection^ get ();
}
member Section : StructuralSection with get
Property Value
StructuralSection
See Also
Reference
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace